app/views/plays/show.html.erb

		<div class="average-review-rating" data-score=<%= @average_review %>></div>
		<span class="number-of-reviews"><em>From: </em><%= @play.reviews.count %> reviews </span>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."play_id" = ?  [["play_id", 20]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."play_id" = ?  [["play_id", 17]]