app/controllers/plays_controller.rb

  def index
	 if params[:category].blank?
	  @plays = Play.all.order("created_at DESC")
	 else
	  @category_id = Category.find_by(name: params[:category]).id
	  @plays = Play.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "plays".* FROM "plays" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Classical"], ["LIMIT", 1]]
SELECT "plays".* FROM "plays" WHERE "plays"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]

	def show
		if @play.reviews.blank?
			@average_review = 0
		else
		    @average_review = @play.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."play_id" = ?  [["play_id", 20]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."play_id" = ?  [["play_id", 18]]

	def new
	 @play = current_user.plays.build
	 @categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def create
	  @play = current_user.plays.build(play_params)
	  @play.category_id = params[:category_id]

		if @play.save
---
INSERT INTO "plays" ("title", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hamilton"], ["description", ""], ["director", ""], ["created_at", 2017-01-10 20:25:59 UTC], ["updated_at", 2017-01-10 20:25:59 UTC]]

	def edit
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def update
      @play.category_id = params[:category_id]

	  if @play.update(play_params)
---
UPDATE "plays" SET "play_img_updated_at" = ?, "updated_at" = ?, "play_img_file_name" = ? WHERE "plays"."id" = ?  [["play_img_updated_at", 2017-01-12 12:32:55 UTC], ["updated_at", 2017-01-12 12:32:56 UTC], ["play_img_file_name", "screenshot.png"], ["id", 17]]

	def destroy
	  @play.destroy
---
DELETE FROM "plays" WHERE "plays"."id" = ?  [["id", 9]]

	def find_play
		@play = Play.find(params[:id])
---
SELECT  "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]