app/controllers/reviews_controller.rb

SELECT  "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "play_id") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@play = Play.find(params[:play_id])
		@review = Review.new(review_params)
		@review.play_id = @play.id
		@review.user_id = current_user.id

		if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", "5"], ["updated_at", 2017-01-12 18:36:05 UTC], ["id", 2]]
---
    def update
    	@review = Review.find(params[:id])
    	if @review.update(review_params)

SELECT  "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def find_play
    	@play = Play.find(params[:play_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
     def find_review
    	@review = Review.find(params[:id])